let str1 = 'abcde abcde abcde abcde';

// Рядок до змін (адже треба ЗАМІНИТИ символи рядка)
console.log(str1);

// Робираємо рядок на масив слів та заміняємо перший символ кожного рядка на '!'
str1 = str1
  .split(' ')
  // Оскільки рядок - це immutable object, треба спочатку робити копію зі змінами, а потім перезаписувати рядок
  .map((w) => '!' + w.slice(1))
  .join(' ');

// Рядок після змін
console.log(str1);

// Хоча в завданні сказано ЗАМІНИТИ символи, ось варіант без перезапису (просто виведення нового рядка):
// console.log(
//   str1
//     .split(' ')
//     .map((w) => '!' + w.slice(1))
//     .join(' '),
// );
